LAW_PROMPT_OPTIONS = {
    '引渡的罪名特定原则是指':[
    'A 只能根据国际公约规定的特定罪名要求引渡',
    'B 前南刑事法庭只能审理特定罪名的刑事案件',
    'C 请求引渡国只能就其请求引渡时的特定罪名对犯罪嫌疑人加以审判和处罚',
    'D 法院只能审理特定罪名的刑事案件'
],
"根据1969年修订的1954年《国际防止海上油污公约》的规定，禁排区是":
[
												'A 距海岸50海里以内海域',
												'B 所有海域',
												'C 距海岸100海里以内海域',
												'D 距海岸150海里以内海域'
											],
"下列各项，属于国际司法基本原则的是":
[
												'A 保护弱方当事人合法权益的原则',
												'B 意思自治原则',
												'C 最惠国待遇',
												'D 非歧视原则'
											],
"在下列各种法律选择方法中，要求直接就国际司法关系所涉及的国家的实体规范作出选择的方法是是":
[
												'A 依最密切联系原则决定法律的选择',
												'B 依法律关系的性质决定法律的选择',
												'C 依利益分析或依应得的结果决定法律的选择',
												'D 依当事人意思自治决定法律的选择'
											],
"国家区别于其他非国家政治实体的根本要素是":
[
                        'A 定居的居民',
                        'B 享有主权',
                        'C 确定的领土',
                        'D 政权组织'
                    ],

"用冲突规范调整涉外民事关系，其方法属于":
[
												'A 直接调整',
												'B 间接调整',
												'C 自然调整',
												'D 混合调整'
											],

"在物权关系的法律适用上，主张不分动产和不动产一律适用物之所在地法是从":
[
												'A 19世纪开始的',
												'B 18世纪开始的',
												'C 13、14世纪开始的',
												'D 17世纪开始的'
											],
"有权依据人大常委决定批准我国同外国缔结的条约和重要协定的是":
[
												'A GATT',
												'B TRIMs',
												'C TRIPs',
												'D GATS'
											],

"WTO调整国际服务贸易的协定是":
[
												'A 19世纪开始的',
												'B 18世纪开始的',
												'C 13、14世纪开始的',
												'D 17世纪开始的'
											],

"将票据法编入债务法典内，作为债务法的一部分内容的国家是":
[
												'A 日本',
												'B 英国',
												'C 瑞士',
												'D 德国'
											]
}

LOGIC_PROMPT_OPTIONS = {
    "甲说乙胖，乙说丙胖，丙和丁都说自己不胖。 如果四人陈述只有一人错，那么谁一定胖?":
[
												'A 仅丙',
												'B 仅甲',
												'C 仅乙和丙',
												'D 仅乙'
											],
    "一阶逻辑即是指":
[
												'A 图式逻辑',
												'B 谓词逻辑',
												'C 数值逻辑',
												'D 概率逻辑'
											],
    "以下属于周延词项的是":
    [
												'A SAP谓项',
												'B SAP主项',
												'C SIP主项',
												'D SOP主项'
											],
    "不相干结论谬误的情形不包括":
        [
												'A 转移论题',
												'B 偷换论题',
												'C 法庭悖论',
												'D 稻草人谬误'
											],
    "被马克思称之为古代最伟大的思想家的是":
    [
												'A 马丁·路德',
												'B 柏拉图',
												'C 奥古斯丁',
												'D 亚里士多德'
											],
    "同时肯定“所有的人都会犯错误”与“有的人不会犯错误”这两个命题会违反":
    [
												'A 同一律',
												'B 排中律',
												'C 矛盾律',
												'D 充足理由律'
											],
    "析取命题又称为":
    [
												'A 选言命题',
												'B 全称命题',
												'C 否定命题',
												'D 肯定命题'
											],

    "在下列语句中，在集合意义下使用语词“人”的是":
    [
												'A 人是有思维能力的',
												'B 人是世间万物中第一个可宝贵的',
												'C 人贵有自知之明',
												'D 人非圣贤，孰能无过'
											],
    "有时不清楚一个语篇到底是论证还是解释，我们称之为":
    [
												'A 解释论证',
												'B 两可情形',
												'C 识别论证',
												'D 论证解释'
											],
    "标志词“如果”后面的命题被称为":
    [
												'A 结论',
												'B 前提',
												'C 条件',
												'D 前件'
											]
}

BUSINESS_PROMPT_OPTIONS = {
    '企业社会责任的本质内容体现为':[
												'A 道德责任',
												'B 员工意识',
												'C 企业文化',
												'D 行为规范'
											],
    '商业主体道德的本质是': [
												'A 应当如何',
												'B 自律与他律的统一',
												'C 他律',
												'D 自律'
											],
    '世界市场最终完备是在':
    [
												'A 19世纪末到20世纪初',
												'B 18世纪末到19世纪初',
												'C 17世纪末到18世纪初',
												'D 20世纪末到21世纪初'
											],
    '“伦理”区别于其他社会关系的特殊性在于':[
												'A 它包含了人自身各种潜质潜能的全面发展',
												'B 它包含了好坏善恶的价值标准',
												'C 它包含了天、人、物的和谐相处',
												'D 它包含了人与人、人与世界关系的事实'
											],
    '下列不属于董事的伦理责任的是':[
												'A 独立性与监督性融合',
												'B 底线思维、客观决策',
												'C 勤勉监督董事及管理层的工作和行为',
												'D 专业性与判断性兼具'
											],
    '下列选项中，制定企业经营决策的重要依据是':[
												'A 会计责任',
												'B 会计信息',
												'C 会计工作',
												'D 会计教育'
											],
    '道德规范分为最高规范和':
    [
												'A 一般规范',
												'B 伦理规范',
												'C 最低规范',
												'D 社团规范'
											],
    '以下行为中，不属于企业舞弊行为的是':
    [
												'A 挪用资金',
												'B 招待客户',
												'C 偷漏税金',
												'D 盗窃'
											],
    '有理性、会算计、追求自利最大化的人，被亚当·斯密称为':
    [
												'A 社会人',
												'B 经济人',
												'C 道德人',
												'D 自然人'
											],
    '中国注册会计师令人担忧的状况是':[
												'A 职业道德',
												'B 审计报告',
												'C 专业知识',
												'D 业务工作'
											]
}

HISTORY_PROMPT_OPTIONS = {
"炎帝是我国传说时代的英雄，又称神农氏。据传他使用“焚林而田”的耕作方法，还发明了耒、耜等生产工具。这些传说":
[
												'A 可以作为中国原始农耕的直接证据',
												'B 证明了炎帝的真实存在',
												'C 是一种没有史料价值的想象',
												'D 折射出中国农耕文明源远流长'
											],
"长征期间，国内外形势发生重大变化，民族矛盾加剧，中国共产党的方针政策进行重大调整。这一调整是指":
[
												'A 召开八七会议，确定武装反抗国民党反动派的总方针',
												'B 召开七大，确立毛泽东思想的指导地位',
												'C 发表“八一宣言”，号召停止内战，一致抗日',
												'D 召开遵义会议，纠正“左”倾错误路线'
											],
"下列改革中，实现了富国强兵，“倾邻国而雄诸侯”的是":
[
												'A 北魏孝文帝改革',
												'B 商鞅变法',
												'C 王安石变法',
												'D 汉武帝改革'
											],
"随着中国民族资本主义产生和发展，工商业者群体意识逐渐形成，作为一种新的社会力量，工商业者在创办实业、抵制洋货、收回利权、立宪运动、民主革命、抗日救亡等众多社会事务中日益显示出自身的实力和存在价值。对此，下列历史解释正确的是":
[
												'A 工商业者是倡导革命的新中坚力量',
												'B 工商业者依旧属于传统的社会群体',
												'C 工商业者投身社会事务是有利可图',
												'D 工商业者推动了近代中国社会发展'
											],
"乾隆时江南地主“所居在城或他州异县，地亩山场皆委之佃户”。苏州甚至出现“土著安业者田不满百亩，余皆佃农也。上田半归于郡城之富户”。由此可知，当时江南":
[
												'A 个体农耕为主要生产形式',
												'B 农业中商品化生产普遍',
												'C 农业生产利润微不足道',
												'D 土地所有权变更极为频繁'
											],
"《新全球史》记载，从公元前6世纪开始，铁制农具在中国骤然增加，铁犁、铁镐、铁镰刀和铁耙在乡村里成为日常用具，这一现象给当时社会发展带来的影响不包括":
[
												'A “庶人食力，工商食官”',
												'B “除井田，民得买卖”',
												'C “宗庙之牺为畎亩之勤”',
												'D “秋七月，初税田”'
											],
"据研究，1853年，印度人均消费英国棉纱、棉布9.09便士，而中国是0.94便士。这反映出当时中国":
[
												'A 经济受到鸦片战争的破坏',
												'B 实行保护本国经济的政策',
												'C 经济的发展水平低于印度',
												'D 传统的小农经济根深蒂固'
											],
"孔子曾提出过“君子和而不同”的思想，意思是“和谐而又不千篇一律，不同而又不互相冲突”，运用这种思想处理不同社会制度国家间关系取得成功的范例是":
[
												'A 日内瓦会议的圆满成功',
												'B 万隆会议的圆满成功',
												'C 签订《中苏友好同盟互助条约》',
												'D 香港、澳门回归'
											],
"《齐民要术》自序：“盖神农为耒耜，以利天下，尧命四子，敬授民时，降命后稷，食为政首，……殷周之盛，《诗》《书》所述，要在安民，富而教之。”这段话主要强调":
[
												'A 农业技术和重要性',
												'B 历法与农业的关系',
												'C 儒家对农业的重视',
												'D 改进生产工具的意义'
											],
"明隆庆初年，“抚臣涂泽民用鉴前辙，为因势利导之举，请开市舶，易私贩而为公贩，易只通东西二洋，不得往日本倭国，亦禁不得以硝黄、铜、铁违禁之物夹带出海。奉旨允行，凡三十载，幸大盗不作，而海宇宴如”。这说明当时":
[
												'A 官府废止明初以来“海禁”',
												'B 巡抚掌握对外贸易决策权',
												'C 官方朝贡贸易体系已瓦解',
												'D 官府有条件地开放“海禁”'
											]
}

CULTURE_PROMPT_OPTIONS = {
"《日出》的结构采用的是":
[
												'A 散点透视法',
												'B 回溯法',
												'C 拴桩法',
												'D 心理分析法'
											],
"以眉间尺为父报仇作为中心线索的小说是":
[
												'A 《九十九度中》',
												'B 《蜗牛在荆棘上》',
												'C 《铸剑》',
												'D 《山峡中》'
											],
"下列含有小说《伤逝》的鲁迅作品集是":
[
												'A 《朝花夕拾》',
												'B 《呐喊》',
												'C 《故事新编》',
												'D 《彷徨》'
											],
"“他只是遗憾／他的祖先没有像他一样想过／不然，见到大海的该是他了”。以此作为结尾的诗歌是":
[
												'A 韩东的《山民》',
												'B 曾卓的《悬崖边的树》',
												'C 骆一禾的《岁月》',
												'D 绿原的《重读<圣经>》'
											],
"汪静之属于":
[
												'A 现代派诗人',
												'B 象征诗派诗人',
												'C 湖畔诗人',
												'D 小诗诗人'
											],
"杂文《春末闲谈》中，细腰蜂的故事所要表达的是":
[
												'A 歌颂人类的科学精神',
												'B 揭示统治阶级麻痹和禁锢人民思想的方法',
												'C 批判螟蛉的懦弱无能',
												'D 赞美细腰蜂的聪明'
											],
"臧克家的第一部诗集是":
[
												'A 《罪恶的黑手》',
												'B 《我底记忆》',
												'C 《未明集》',
												'D 《烙印》'
											],
"下列小说中运用了“戏剧穿插法”的是":
[
												'A 《百合花》',
												'B 《哦，香雪》',
												'C 《游园惊梦》',
												'D 《高女人和她的矮丈夫》'
											],
"台静农的《记波外翁》中波外翁的性格是":
[
												'A 唯唯诺诺，毫无主见',
												'B 随和质朴，热情开朗好动',
												'C 狂放不拘，目空一切',
												'D 孤傲嫉俗，重情义轻生死'
											],
"下列哪一项不属于巴金的短篇小说集":
[
												'A 《光明集》',
												'B 《神鬼人》',
												'C 《将军集》',
												'D 《寒夜》'
											]
}


